main:
    li $1, 0x10
    li $2, 0x800
    mult $1, $2 # 乘法
    mflo $3 # 取乘法结果
    mfhi $4 # 取乘法高位结果
    div $3, $1 # 除法
    mflo $5 # 取除法结果
    add $6, $1, $2 # 加法
    addu $7, $1, $2 # 无溢出加法
    sub $8, $1, $2 # 减法
    subu $9, $1, $2 # 无溢出减法
    sllv $10, $1, $2 # 逻辑左移变址
    srlv $11, $1, $2 # 逻辑右移变址
    srav $13, $1, $2 # 算术右移变址
    sll $12, $1, 10 # 逻辑左移立即数
    srl $15, $1, 5 # 逻辑右移立即数
    sra $16, $1, 3 # 算术右移立即数
    and $17, $1, $2 # 按位与
    or $18, $1, $2 # 按位或
    xor $19, $1, $2 # 按位异或
    nor $19, $1, $2 # 按位或非
    slt $19, $1, $2 # 设置小于
    sltu $19, $1, $2 # 无符号设置小于
    multu $1, $2 # 无符号乘法
    divu $1, $2 # 无符号除法  
    xori $1, $1, 1 # $1和1按位异或立即数
    mthi $3 # 设置乘法高位寄存器
    mtlo $4 # 设置乘法低位寄存器

	li $v0, 0x0a
    syscall